app/controllers/cars_controller.rb

  def index
    #@cars = Car.where("location LIKE ?", "%#{params[:search ]}%")
    #Fetch all reservations, update their status and car status respectively
    @reservations = Reservation.all
    @reserved = false
    @reservations.each do |reservation|
      if(reservation.status == "Reserved" && reservation.userid == current_user.id)
        @reserved = true
      end
      if reservation.startdate + 30.minutes < Time.now && reservation.status = "Reserved"
        reservation.update(status: "Cancelled")
        reservation.save
        @car = Car.find_by(id: reservation.carid)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

      end
    end
    if (current_user.superadmin_role? || current_user.supervisor_role?)
      @cars=Car.all
---
SELECT "cars".* FROM "cars" WHERE (location LIKE)

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("created_at", "updated_at", "name", "model", "manufacturer", "hourly_rate", "style", "location", "carstatus") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "location" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["location", "California"], ["updated_at", "2017-09-25 06:49:46.456529"], ["id", 1]]